In [13]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import matplotlib
matplotlib.rcParams['figure.figsize']=(15,7)

In [4]:
df = pd.read_csv('tested.csv')

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [9]:
# Checking if there are null values withi the dataset.

features_with_null_values=[feature for feature in df.columns if df[feature].isnull().sum() > 0]

In [10]:
features_with_null_values

['Age', 'Fare', 'Cabin']

In [14]:
# Finding the percentage of th
for feature in features_with_null_values:
    print (np.round(df[feature].isnull().mean(), 4))

0.2057
0.0024
0.7823